; domain
(define (domain imv-multi-agent)
  (:requirements :strips :typing :negation :conditional-effects :existential-preconditions)

  (:types
    location item agent count - object
    robot drone - agent
    artifact pod - item
  )

  (:predicates
    (at ?o - object ?l - location)
    (connected ?l1 ?l2 - location)
    
    ;; Gestione Inventario
    (holding ?a - agent ?i - item)
    (load ?a - agent ?c - count)         
    (next ?c1 ?c2 - count)               
    (capacity-ok ?a - agent ?c - count)  
    
    ;; Proprietà Oggetti
    (inside ?art - item ?p - item)
    (empty ?p - item)
    (transportable ?i - item)      
    
    ;; Ambiente
    (seismic-active ?l - location) 
    
    ;; Stato di Blocco
    (blocked ?a - agent) 
  )

  ;; --- MOVIMENTO ---
  
  (:action move-freely
    :parameters (?a - agent ?from ?to - location)
    :precondition (and 
        (at ?a ?from) 
        (connected ?from ?to)
        (load ?a n0) 
    )
    :effect (and (not (at ?a ?from)) (at ?a ?to))
  )

  (:action move-carrying
    :parameters (?a - agent ?from ?to - location)
    :precondition (and 
        (at ?a ?from) 
        (connected ?from ?to)
        (not (load ?a n0)) 
        (not (blocked ?a)) 
    )
    :effect (and (not (at ?a ?from)) (at ?a ?to))
  )

  ;; --- RACCOLTA (MODIFICATA) ---
  
  (:action pick-up
    :parameters (?a - agent ?i - item ?l - location ?c_pre ?c_post - count)
    :precondition (and 
        (at ?a ?l) (at ?i ?l)
        (load ?a ?c_pre) (next ?c_pre ?c_post) (capacity-ok ?a ?c_post)
        (not (seismic-active ?l)) 
        
        ;; --- NUOVA CONDIZIONE ---
        ;; Se l'oggetto è transportable (sicuro), OK.
        ;; Se NON lo è (fragile), devi GIA' avere in mano un pod vuoto.
        (or (transportable ?i)
            (exists (?p - pod) (and (holding ?a ?p) (empty ?p)))
        )
    )
    :effect (and 
        (not (at ?i ?l)) 
        (holding ?a ?i)
        (not (load ?a ?c_pre)) (load ?a ?c_post)
        (when (not (transportable ?i)) (blocked ?a))
    )
  )

  ;; --- RILASCIO ---
  
  (:action drop
    :parameters (?a - agent ?i - item ?l - location ?c_pre ?c_post - count)
    :precondition (and 
        (at ?a ?l) (holding ?a ?i)
        (load ?a ?c_pre) (next ?c_post ?c_pre)
    )
    :effect (and 
        (at ?i ?l) 
        (not (holding ?a ?i))
        (not (load ?a ?c_pre)) (load ?a ?c_post)
        
        ;; Sblocca SOLO se posi l'oggetto fragile. 
        ;; Se posi il Pod (oggetto sicuro) mentre hai l'artefatto fragile nell'altra mano, 
        ;; rimani bloccato (corretto, perché non puoi muoverti col fragile nudo).
        (when (not (transportable ?i)) (not (blocked ?a)))
    )
  )

  ;; --- GESTIONE POD ---

  (:action load-pod
    :parameters (?a - agent ?art - item ?pod - item ?l - location ?c_pre ?c_post - count)
    :precondition (and 
        (at ?a ?l) (at ?pod ?l) (holding ?a ?art) (empty ?pod)
        (load ?a ?c_pre) (next ?c_post ?c_pre) 
        (not (seismic-active ?l))
    )
    :effect (and 
        (not (holding ?a ?art))
        (not (empty ?pod)) 
        (inside ?art ?pod)
        (not (load ?a ?c_pre)) (load ?a ?c_post)
        ;; L'artefatto è al sicuro -> sblocco
        (not (blocked ?a))
    )
  )

  (:action unload-pod
    :parameters (?a - agent ?art - item ?pod - item ?l - location ?c_pre ?c_post - count)
    :precondition (and 
        (at ?a ?l) (at ?pod ?l) (inside ?art ?pod)
        (load ?a ?c_pre) (next ?c_pre ?c_post) (capacity-ok ?a ?c_post) 
        (not (seismic-active ?l))
    )
    :effect (and 
        (holding ?a ?art)
        (empty ?pod)
        (not (inside ?art ?pod))
        (not (load ?a ?c_pre)) (load ?a ?c_post)
        (when (not (transportable ?art)) (blocked ?a))
    )
  )
)

; problem
(define (problem imv-problem-2-final)
  (:domain imv-multi-agent)

  (:objects
    curator - robot
    drone1 - drone
    
    entrance tunnel hall_a hall_b cryo stasis pods_room - location
    
    art_alpha art_beta mars_core - artifact
    pod1 pod2 - pod
    
    n0 n1 n2 - count
  )

  (:init
    ;; Topologia
    (connected entrance tunnel) (connected tunnel entrance)
    (connected tunnel hall_a)   (connected hall_a tunnel)
    (connected tunnel hall_b)   (connected hall_b tunnel)
    (connected tunnel cryo)     (connected cryo tunnel)
    (connected tunnel stasis)   (connected stasis tunnel)
    (connected tunnel pods_room)(connected pods_room tunnel)

    ;; Stato Agenti
    (at curator entrance) (load curator n0)
    (at drone1 entrance)  (load drone1 n0)

    ;; Capacità: Il Drone e il Curator possono portare fino a 2 oggetti
    (capacity-ok drone1 n0) (capacity-ok drone1 n1) (capacity-ok drone1 n2)
    (capacity-ok curator n0) (capacity-ok curator n1) (capacity-ok curator n2)
    
    ;; Numeri
    (next n0 n1) (next n1 n2)

    ;; Oggetti e posizioni iniziali
    (at art_alpha hall_a)
    (at art_beta hall_b)
    (at mars_core cryo)
    (at pod1 pods_room) (empty pod1)
    (at pod2 pods_room) (empty pod2)

    ;; --- REGOLE DI TRASPORTABILITÀ ---
    (transportable pod1)
    (transportable pod2)
    (transportable art_alpha)
    (transportable mars_core)
    ;; NOTA: art_beta NON è presente qui. 
    ;; Questo significa che (transportable art_beta) è FALSO.
    ;; Raccoglierlo causerà (blocked ?agent).

    ;; --- SISMICITÀ ---
    ;; (seismic-active hall_b) <-- Decommentare se si vuole simulare attività sismica
  )

  (:goal
    (and
      ;; 1. Art Beta portato allo Stasis Lab
      (at art_beta stasis)
      
      ;; 2. Il Pod usato deve tornare al suo posto (Pods Room)
      (at pod1 pods_room)

      ;; 3. Art Alpha alla Cryo
      (at art_alpha cryo)

      ;; 4. Core Sample allo Stasis
      (at mars_core stasis)
    )
  )
)

; plan
1. (move-freely curator entrance tunnel)
   deleted: (at curator entrance)
   added: (at curator tunnel)
   goals met: 1 of 4
2. (move-freely curator tunnel cryo)
   deleted: (at curator tunnel)
   added: (at curator cryo)
   goals met: 1 of 4
3. (pick-up curator mars_core cryo n0 n1)
   deleted: (at mars_core cryo) (load curator n0)
   added: (holding curator mars_core) (load curator n1)
   goals met: 1 of 4
4. (move-carrying curator cryo tunnel)
   deleted: (at curator cryo)
   added: (at curator tunnel)
   goals met: 1 of 4
5. (move-carrying curator tunnel hall_a)
   deleted: (at curator tunnel)
   added: (at curator hall_a)
   goals met: 1 of 4
6. (pick-up curator art_alpha hall_a n1 n2)
   deleted: (at art_alpha hall_a) (load curator n1)
   added: (holding curator art_alpha) (load curator n2)
   goals met: 1 of 4
7. (move-carrying curator hall_a tunnel)
   deleted: (at curator hall_a)
   added: (at curator tunnel)
   goals met: 1 of 4
8. (move-carrying curator tunnel cryo)
   deleted: (at curator tunnel)
   added: (at curator cryo)
   goals met: 1 of 4
9. (drop curator art_alpha cryo n2 n1)
   deleted: (holding curator art_alpha) (load curator n2)
   added: (at art_alpha cryo) (load curator n1)
   goals met: 2 of 4
10. (move-carrying curator cryo tunnel)
   deleted: (at curator cryo)
   added: (at curator tunnel)
   goals met: 2 of 4
11. (move-carrying curator tunnel pods_room)
   deleted: (at curator tunnel)
   added: (at curator pods_room)
   goals met: 2 of 4
12. (pick-up curator pod1 pods_room n1 n2)
   deleted: (at pod1 pods_room) (load curator n1)
   added: (holding curator pod1) (load curator n2)
   goals met: 1 of 4
13. (move-carrying curator pods_room tunnel)
   deleted: (at curator pods_room)
   added: (at curator tunnel)
   goals met: 1 of 4
14. (drop curator mars_core tunnel n2 n1)
   deleted: (holding curator mars_core) (load curator n2)
   added: (at mars_core tunnel) (load curator n1)
   goals met: 1 of 4
15. (move-carrying curator tunnel hall_b)
   deleted: (at curator tunnel)
   added: (at curator hall_b)
   goals met: 1 of 4
16. (pick-up curator art_beta hall_b n1 n2)
   deleted: (at art_beta hall_b) (load curator n1)
   added: (holding curator art_beta) (load curator n2) (blocked curator)
   goals met: 1 of 4
17. (move-freely drone1 entrance tunnel)
   deleted: (at drone1 entrance)
   added: (at drone1 tunnel)
   goals met: 1 of 4
18. (pick-up drone1 mars_core tunnel n0 n1)
   deleted: (at mars_core tunnel) (load drone1 n0)
   added: (holding drone1 mars_core) (load drone1 n1)
   goals met: 1 of 4
19. (drop curator pod1 hall_b n2 n1)
   deleted: (holding curator pod1) (load curator n2)
   added: (at pod1 hall_b) (load curator n1)
   goals met: 1 of 4
20. (move-carrying drone1 tunnel stasis)
   deleted: (at drone1 tunnel)
   added: (at drone1 stasis)
   goals met: 1 of 4
21. (drop drone1 mars_core stasis n1 n0)
   deleted: (holding drone1 mars_core) (load drone1 n1)
   added: (at mars_core stasis) (load drone1 n0)
   goals met: 2 of 4
22. (drop curator art_beta hall_b n1 n0)
   deleted: (holding curator art_beta) (load curator n1) (blocked curator)
   added: (at art_beta hall_b) (load curator n0)
   goals met: 2 of 4
23. (move-freely curator hall_b tunnel)
   deleted: (at curator hall_b)
   added: (at curator tunnel)
   goals met: 2 of 4
24. (move-freely curator tunnel pods_room)
   deleted: (at curator tunnel)
   added: (at curator pods_room)
   goals met: 2 of 4
25. (pick-up curator pod2 pods_room n0 n1)
   deleted: (at pod2 pods_room) (load curator n0)
   added: (holding curator pod2) (load curator n1)
   goals met: 2 of 4
26. (move-carrying curator pods_room tunnel)
   deleted: (at curator pods_room)
   added: (at curator tunnel)
   goals met: 2 of 4
27. (move-carrying curator tunnel hall_b)
   deleted: (at curator tunnel)
   added: (at curator hall_b)
   goals met: 2 of 4
28. (pick-up curator art_beta hall_b n1 n2)
   deleted: (at art_beta hall_b) (load curator n1)
   added: (holding curator art_beta) (load curator n2) (blocked curator)
   goals met: 2 of 4
29. (move-freely drone1 stasis tunnel)
   deleted: (at drone1 stasis)
   added: (at drone1 tunnel)
   goals met: 2 of 4
30. (drop curator art_beta hall_b n2 n1)
   deleted: (holding curator art_beta) (load curator n2) (blocked curator)
   added: (at art_beta hall_b) (load curator n1)
   goals met: 2 of 4
31. (move-carrying curator hall_b tunnel)
   deleted: (at curator hall_b)
   added: (at curator tunnel)
   goals met: 2 of 4
32. (move-carrying curator tunnel stasis)
   deleted: (at curator tunnel)
   added: (at curator stasis)
   goals met: 2 of 4
33. (move-freely drone1 tunnel hall_b)
   deleted: (at drone1 tunnel)
   added: (at drone1 hall_b)
   goals met: 2 of 4
34. (pick-up drone1 pod1 hall_b n0 n1)
   deleted: (at pod1 hall_b) (load drone1 n0)
   added: (holding drone1 pod1) (load drone1 n1)
   goals met: 2 of 4
35. (pick-up drone1 art_beta hall_b n1 n2)
   deleted: (at art_beta hall_b) (load drone1 n1)
   added: (holding drone1 art_beta) (load drone1 n2) (blocked drone1)
   goals met: 2 of 4
36. (move-carrying curator stasis tunnel)
   deleted: (at curator stasis)
   added: (at curator tunnel)
   goals met: 2 of 4
37. (drop drone1 pod1 hall_b n2 n1)
   deleted: (holding drone1 pod1) (load drone1 n2)
   added: (at pod1 hall_b) (load drone1 n1)
   goals met: 2 of 4
38. (load-pod drone1 art_beta pod1 hall_b n1 n0)
   deleted: (holding drone1 art_beta) (empty pod1) (load drone1 n1) (blocked drone1)
   added: (inside art_beta pod1) (load drone1 n0)
   goals met: 2 of 4
39. (move-carrying curator tunnel stasis)
   deleted: (at curator tunnel)
   added: (at curator stasis)
   goals met: 2 of 4
40. (pick-up drone1 pod1 hall_b n0 n1)
   deleted: (at pod1 hall_b) (load drone1 n0)
   added: (holding drone1 pod1) (load drone1 n1)
   goals met: 2 of 4
41. (move-carrying drone1 hall_b tunnel)
   deleted: (at drone1 hall_b)
   added: (at drone1 tunnel)
   goals met: 2 of 4
42. (move-carrying drone1 tunnel stasis)
   deleted: (at drone1 tunnel)
   added: (at drone1 stasis)
   goals met: 2 of 4
43. (drop drone1 pod1 stasis n1 n0)
   deleted: (holding drone1 pod1) (load drone1 n1)
   added: (at pod1 stasis) (load drone1 n0)
   goals met: 2 of 4
44. (unload-pod curator art_beta pod1 stasis n1 n2)
   deleted: (inside art_beta pod1) (load curator n1)
   added: (holding curator art_beta) (empty pod1) (load curator n2) (blocked curator)
   goals met: 2 of 4
45. (drop curator art_beta stasis n2 n1)
   deleted: (holding curator art_beta) (load curator n2) (blocked curator)
   added: (at art_beta stasis) (load curator n1)
   goals met: 3 of 4
46. (pick-up curator pod1 stasis n1 n2)
   deleted: (at pod1 stasis) (load curator n1)
   added: (holding curator pod1) (load curator n2)
   goals met: 3 of 4
47. (move-carrying curator stasis tunnel)
   deleted: (at curator stasis)
   added: (at curator tunnel)
   goals met: 3 of 4
48. (move-carrying curator tunnel pods_room)
   deleted: (at curator tunnel)
   added: (at curator pods_room)
   goals met: 3 of 4
49. (drop curator pod1 pods_room n2 n1)
   deleted: (holding curator pod1) (load curator n2)
   added: (at pod1 pods_room) (load curator n1)
   goals met: 4 of 4
